#Овен (21.03 – 20.04)
#Телець (21.04 – 21.05)
#Близнята (22.05 – 21.06)
#Рак (22.06 – 22.07)
#Лев (23.07 – 21.08)
#Діва (22.08 – 23.09)
#Терези (24.09 – 23.10)
#Скорпіон (24.10 – 22.11)
#Стрілець (23.11 – 21.12)
#Козеріг (22.12 – 20.01)
#Водолій (21.01 – 18.02)
#Риби (19.02 – 20.03)



import calendar
import datetime

day = int(input('Введіть день вашого народження: '))
month = int(input('Введіть місяць вашого народження: '))
max_day = calendar.monthrange(2023, month)[1]

user_date = datetime.date(2023, month, day)
if datetime.date(2023, 1, 21) <= user_date <= datetime.date(2023, 2, 18):
    print('Ти Водолій')
    print('Згідно з характеристикою знака - це цілеспрямовані і творчі люди. Водолій, що вступив у свою фазу, уособлює революційні перетворення на планеті Земля. Цей час — символ відмовитися від буденності, енергія душі і розуму звеличується і перетворюється на щось нове і незвичайне. Знак знайшов себе і в незвичному символі, який більше нагадує струм, ніж морські хвилі.')
elif datetime.date(2023, 2, 19) <= user_date <= datetime.date(2023, 3, 20):
    print('Ти Риби')
    print('Можна відзначити, що це найчутливіші натури, які звикли і можуть співпереживати іншим. Якщо дивитися на них загалом, то виділяється їхня здатність усюди приживатися. Кожна сфера життя їм підпорядкована. Вони легко знаходять спільну мову, тому швидко обзаводяться друзями у потрібному місці. Вираз "як риба у воді", точно про них, оскільки зручно плавають всюди.')
elif datetime.date(2023, 3, 21) <= user_date <= datetime.date(2023, 4, 20):
    print('Овен')
    print('Знак зодіаку Овен виступає першим у гороскопі. Якщо дивитися на символіку, то він символізує баранячу голову, яка утворилася в результаті жертвопринесення богам для благополуччя всіх на землі.')
elif datetime.date(2023, 4, 21) <= user_date <= datetime.date(2023, 5, 21):
    print('Телець')
    print('Знак зодіаку Телець – фіскальний. До нього належать люди, яких називають творцями та гурманами. Дуже люблять жити, спостерігати за прекрасним та прагнути цього. Терплячі і витривалі. Заради своєї мети готові виявити неабияку завзятість чи впертість. Він любить працювати і робить це добре.')
elif datetime.date(2023, 5, 22) <= user_date <= datetime.date(2023, 6, 21):
    print('Близнята')
    print('З інтелектуалами і дотепниками, які вміють цікаво розповідати, багато знають і люблять дізнаватися про нове, приємно мати справу. Здається, знаку все легко. Вивчення іноземних мов йде швидко та успішно, література не завдає проблем у школі та дарує насолоду протягом усього життя. Багатьох зодіакальних близнюків тягне до акторської професії. Але, звичайно, негативні якості є навіть у цих чарів. Мінливість – одна з головних. За день думка з одного питання може змінитись пять разів.')
elif datetime.date(2023, 6, 22) <= user_date <= datetime.date(2023, 7, 22):
    print('Рак')
    print('Стихія Води подарувала черговий знак зодіаку - Рак. Він настає у проміжку між 22 червня та 22 липня. Їхніми покровителями виступають - Місяць та Юпітер.')
elif datetime.date(2023, 7, 23) <= user_date <= datetime.date(2023, 8, 21):
    print('Лев')
    print('Дивлячись на представників цього сузіря, мимоволі ними захоплюєшся і тягнешся ближче до сильної особи. Знак зодіаку Лев відноситься до стихії вогню. Період із 23 липня по 22 серпня.')
elif datetime.date(2023, 8, 22) <= user_date <= datetime.date(2023, 9, 23):
    print('Діва')
    print('Втілення справедливості, розуму та краси – Діви. Це другий знак, який належить до земної стихії. Можна відзначити, що представники дуже тонко відчувають і чують, мають гарний музичний слух і вокальні дані. Люблять прекрасне, тому, бачачи вади, намагаються їх виправити. Протягом усього життя розвиваються та навчаються. Намагаються бути у всьому, хто розуміє. Крім самонавчання, допомагають іншим набути знання.')
elif datetime.date(2023, 9, 24) <= user_date <= datetime.date(2023, 10, 23):
    print('Терези')
    print('Народжених з 24 вересня по 23 жовтня тягне гармонії та задоволення. Відносини, робота, бізнес, дружба повинні радувати та приносити задоволення. Від зірок отримано схильність до певних професій, які потребують чесності та розважливості. Незважаючи на егоїзм, справедливість для Терезів - не порожній звук, їх часто зустрінеш у юриста, в суді. Бути поряд з ним, які мають творчу силу, надійно і спокійно.')
elif datetime.date(2023, 10, 24) <= user_date <= datetime.date(2023, 11, 22):
    print('Скорпіон')
    print('Сексуальний, харизматичний тип, що привертає увагу. Саме так виглядає типовий Скорпіон. Вміє контролювати емоції, залишається загадкою для оточуючих. Не думайте, що вам пощастить його поранити. Особа не реагує на образи, та й компліментів особливо не потребує. Знає собі ціну, тому бажає чути характеристику з чужих вуст.')
elif datetime.date(2023, 11, 23) <= user_date <= datetime.date(2023, 12, 21):
    print('Стрільць')
    print('У той час, коли на Землі настає фаза Стрільця, планету накриває темрява та невідомість. Природа, занурившись у сплячку, наче перечікує цей час, побоюючись невідомості та темряви. У цей час року Землі гостро бракує сонячного світла, через що багато хвороб загострюються, людей дедалі частіше відвідують невеселі думки. Мимоволі саме в цей період люди починають шукати нові шляхи для отримання життєвої енергії та знаходять її у нових знаннях, спілкуванні з іншими людьми.')
elif datetime.date(2023, 12, 22) <= user_date <= datetime.date(2023, 1, 20):
    print('Козеріг')
    print('Знак Землі - Козеріг має життєву силу і витривалий')